app/controllers/articles_controller.rb

    def destroy
        Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2020-01-04 20:51:14.529016"], ["image_file_name", "index.jpeg"], ["updated_at", "2020-01-04 20:51:14.560840"], ["id", 4]]